errors.required=Campo obrigatorio {0}.
error.delete.timestamp=Existem adicionais nos lan\u00E7amentos deste dia, primeiro exclua lan\u00E7amentos que geraram adicionais.
errors.minlength={0} nao pode ser menor que {1} caracters.
errors.maxlength={0} nao pode ser maior que {2} caracters.
errors.invalid={0} e invalido.
errors.byte={0} deve ser um byte.
errors.short={0} deve ser um short.
errors.integer={0} deve ser um integer.
errors.long={0} deve ser um long.
errors.float={0} deve ser um float.
errors.double={0} deve ser um double.
errors.date={0} nao e uma data.
errors.range={0} nao esta no range {1} ate  {2}.
error.horario.inicio.ocupado=A hora in\u00EDcio deste lan\u00E7amento n\u00E3o est\u00E1 livre.
error.horario.fim.ocupado=A hora fim deste lan\u00E7amento n\u00E3o est\u00E1 livre.
error.intervalo.ocupado=O intervalo informado n\u00E3o est\u00E1 livre.
errors.creditcard={0} nao e um numero de cartao valido.
errors.email={0} email invalido.

index.title=F9C Global Security- Timesheet
prompt.loginname=Usu\u00E1rio
prompt.password=Senha
page.area=\u00C1rea
page.activity=Atividade
page.regra=Regra
page.client=Cliente
page.deslocamento=Deslc
page.label.deslocamento=Deslocamento
page.label.tipo.deslocamento=Tipo Deslocamento
page.opportunity=Oportunidade
page.vertical=Vertical
page.hora.negativa=Horas Negativas

page.user=Usu\u00E1rio
page.consultor=Consultor
page.viewing=Visualiza\u00E7\u00E3o
page.adicional=Adic
page.time_total=Horas Normais
page.time_total_geral=Total Geral
page.time_total_deslocamento=Horas Deslocamentos
page.time_total_adicional=Horas Adicionais
page.time_total_bonus=Horas Ajuste
page.time_total_aprovadas=Horas Aprovadas
page.time_total_bloqueadas=Horas Bloqueadas
page.time_total_rejeitadas=Horas Rejeitadas
page.time_total_abertas=Horas Abertas

page.day=Dia
page.amount=Normal
page.bonus=Ajuste Gestor
page.description=Descri\u00E7\u00E3o
page.search=Busca
page.create_new_timestamp=Cria novo lancamento
page.start=Data
page.end=Fim
page.project=Iniciativa SAP
page.type=Atua\u00E7\u00E3o
page.fee=Taxa
page.deduct=Dedu\u00E7\u00E3o
page.leave_open=Em aberto
page.mailout=Enviar email de confirma\u00E7\u00E3o
page.back_to_main_view=Voltar a p\u00E1gina principal
page.email=Email
page.repeat_password=Repetir senha
page.Columns=Colunas
page.Sample=Examplo
page.status=Status
page.filter=Filtro
page.Set_all=Aplicar status
page.sub_project_create=Criar novo sub-projeto
page.setupError=Ocorreu o seguinte erro, verifique se suas configura\u00E7\u00F5es est\u00E3o vaild\:\r\n{0}
page.setupError.sql=Houve um erro ao testar as tabelas. Certifique-se o banco de dados est\u00E1 inicializado
page.setupHelp=O formul\u00E1rio a seguir exibe as configura\u00E7\u00F5es de banco de dados atual. Depois de ter sucesso com banco de dados acima, voc\u00EA deve salvar as configura\u00E7\u00F5es. Suas configura\u00E7\u00F5es de conex\u00E3o ser\u00E3o testadas. Depois de testes bem-sucedidos e salvar o sistema vai come\u00E7ar a operar no modo normal. <p/>
page.setupInit=O formul\u00E1rio abaixo \u00E9 para reinicializar o banco de dados. <b> <br/> Tome muito cuidado, isso vai repor as bases de dados existentes, sem perguntas. </ b> <p/> 
page.setupMail=As configura\u00E7\u00F5es de SMTP s\u00E3o para envio de e-mails de notifica\u00E7\u00E3o ao gerente de projeto se os lan\u00E7amentos ser\u00E3o adicionados. No momento s\u00F3 o envio via localhost\: 25 \u00E9 suportado. Isto significa que voc\u00EA precisa de um servidor de email rodando localmente.
page.setupStart=Esta \u00E9 a p\u00E1gina de configura\u00E7\u00E3o para o timesheet. Por favor, preencha os seguintes par\u00E2metros para usar com sucesso. Se voc\u00EA n\u00E3o for o administrador, entre em contato com ele para a cria\u00E7\u00E3o par\u00E2metros atrav\u00E9s desta p\u00E1gina. <b> <br/> Como um primeiro passo que voc\u00EA tem que inititalize o banco de dados, na primeira forma de "inicializa\u00E7\u00E3o de banco de dados", em seguida, salvar suas configura\u00E7\u00F5es de conex\u00E3o do banco de dados permanentemente no segundo formul\u00E1rio "Configura\u00E7\u00E3o de Banco de Dados"abaixo. </b>
page.setupWarning=Os seguintes erros podem ser alguns avisos e erros sobre a remo\u00E7\u00E3o de restri\u00E7\u00F5es. Normalmente voc\u00EA pode ignor\u00E1-los.

page.tip_1=Dica\: Clique em "Salvar e Novo..." para copiar o lan\u00E7amento atual para outra data.
page.tip_2=Dica\: Mantenha a senha em branco se n\u00E3o quiser alter\u00E1-la.
page.tip_3=Dica\: Quando houver dois deslocamentos no mesmo dia para o mesmo cliente, selecionar "sem deslocamento" no segundo lan\u00E7amento. 
page.tip_4=Dica\: Todo os usu\u00E1rios ser\u00E3o automaticamente desconectado ap\u00F3s submeter este formul\u00E1rio para salvar a integridade dos dados
page.tip_5=Dica\: Se voc\u00EA quiser redefinir sua configura\u00E7\u00E3o mais tarde, voc\u00EA tem que remover as informa\u00E7\u00F5es de configura\u00E7\u00E3o no local de prefer\u00EAncia Java. Que \u00E9 armazenada sob o home do usu\u00E1rio do container web que est\u00E1 sendo executado.
page.tip_6=Dica\: .

page.Name=Nome
page.Period=Per\u00EDodo
page.Project=Projeto
page.Time_total=Total Horas
page.Time_at_weekdays=Horas em dias da semana.
page.Time_at_weekends=Hora nos finais de semana.
page.Total_amount=Total de horas.

page.Start_Export=Listar Horas
page.Export_Tipo=Imprimir em
page.Start_All_Export= Listar Horas Mensal
page.Date_Start=Data Início
page.Date_End=Data Fim
page.Time_Start=Hora In\u00EDcio
page.Time_End=Hora fim
page.save_changes=Enviar

menu.Main=Principal
menu.Export=Exportar
menu.Settings=Configura\u00E7\u00E3o
menu.Administration=Administração
menu.Setup=Setup
menu.Logout=Sair

error.project.access.invalid=Você não tem permissão para visualizar este projeto.
error.user.access.invalid=Você não tem permissão para visualizar este usuário.

error.internal=Ocorreu um erro\:
error.internal.message={0}

error.session=Sessão encerrada. Efetue novo login.

error.database=Ocorreu um ero no banco de dados. Verifique as prefer\u00EArncias do usu\u00E1rio java em \: {0}

error.timestamp.invalid=Esse lançamento não existe.
error.timestamp.too.old=A data deste lançamento não é da semana corrente.
error.operation.invalid=Operaçao não definida.
error.user.not.owner=Acesso negado.
error.user.not.assigned=Usuário não cadastrado para este projeto.
error.user.invalid=Usuário não existe.
error.assignment.invalid=Lançamento não existe.
error.logged.user.invalid=Login não existe.
error.no.projects.available=Não existe projetos associados. Contate o administrator.
error.no.timestamps.available=Não existem lançamentos para o usuário {0}!

error.database.access.failed=Não foi possível acessar o banco de dados.

error.logon.notlisted=Usuário ou senha inválidos.
error.logon.password=This username/password pair does not match.

error.header=Ocorreu um erro, por favor verifique os dados informados:
error.year.range.invalid=O ano deve ser um número positivo
error.month.range.invalid=Por favor insira um número entre 1 a 12.
error.day.range.invalid=Por favor insira um número entre 1 a 31.
error.hours.range.invalid=The time for begin or end is invalid. Please specify a number between 0 and 23.
error.minutes.range.invalid=The time for begin or end is invalid.Please specify a number between 0 and 59.
error.number.format.wrong=Please enter a number.
error.date.format.wrong=Please enter the date in the form YYYY-DD-MM.
error.time.in.future=The end of working time is too far in the future.
error.difference.negative=A data final é menor que a data inicial.
error.export.date.invalid=The date range is invalid. Please check In\u00EDcio and End.
error.parse=Dados inv\u00E1lidos. Verifique se os n\u00FAmeros das horas foram informados corretamente.
error.email=There was an error sending the confirmation email. Your data was saved, but please contact your \
    administrator to fix this issue.
error.project.exists=The project with that name "{0}" already exists.

error.admin.header=Ocorreu um erro no último processamento:
error.admin.access.denied=Acesso negado.
error.user.already.assigned=Lançamento já existe.
error.user.already.exists=A user with that login already exists.
error.project.already.exists=A project with that name already exists.
error.password.mismatch=The two passwords do not match.
error.login.header=Login failed due to the following reason:
error.admin.timestamps=There are still timestamps associated to this object.
error.demomode=This action is not allowed in demo mode of TTraq.


success.timestamp.created=O lan\u00E7amento [ {0} ] foi criado com sucesso.
success.timestamp.modified=O lan\u00E7amento [ {0} ] foi alterado com sucesso.
success.timestamp.deleted=O lan\u00E7amento [ {0} ] foi exclu\u00EDdo com sucesso.
success.assignment.added=Assigned {0} to project {1}.
success.assignment.deleted=Deleted the assignment of {0} to project {1}.
success.password.changed=Senha alterada com sucesso.
success.database.inited=Database was successfully inited. Please enter now your settings in "Database setup" below and save your settings.
success.object.saved=Dados salvos com sucesso.

hint.viewuser.changed={0} is not assigned to {2}. Now viewing {1} instead.
hint.project.changed=Project {0} has no users assigned. Now viewing project {1} instead.
hint.assignment=Associa\u00E7\u00E3o de um usu\u00E1rio com um projeto. Os usu\u00E1rios podem ser atribu\u00EDdos apenas a "projetos", s\u00E3o sempre atribu\u00EDdos \u00E0 subprojetos. Se um usu\u00E1rio \u00E9 gerente de um projeto ele receber\u00E1 todos os e-mails de notifica\u00E7\u00E3o em rela\u00E7\u00E3o a este projeto e pode aprovar (mudar o status de uma hora).
hint.status=O status de uma hora. Aconselhamos a usar c\u00F3digos de status como "Aprovado", "Recusado" e "Bloqueada". Para a descri\u00E7\u00E3o de uma cor para o status pode ser definido. Nota\: Abaixo destes c\u00F3digos de estado, data e hora pode ter um status de aberto. Isso significa que o tempo final n\u00E3o foi inserida ainda. Lan\u00E7amentos abertos s\u00E3o sempre marcados luz vermelha na vis\u00E3o geral.
hint.type=O tipo de uma hora pode ser usado para diferentes categorias de marcas de tempo, por exemplo\: "O tempo de trabalho", "O tempo de viagem", "\u00FAnica despesa", "Informa\u00E7\u00E3o", "Observa\u00E7\u00E3o". O conceito de raiz de uma hora \u00E9 uma fatia do tempo de trabalho, \u00E9 claro, mas tamb\u00E9m pode ser usada para outros tipos de obras a respeito de um projeto. A taxa de inadimpl\u00EAncia hora d\u00E1 uma possibilidade aproximada de introduzir um sal\u00E1rio, que ajuda a calcular um pre\u00E7o, se voc\u00EA selecionou o "clearing Time base".

button.cancel=Cancelar
button.save=Salvar
button.saveNew=Salvar e Novo...